app/controllers/envelopes_controller.rb

  def show
    @envelope = Envelope.find(params[:id])
---
SELECT * FROM "envelopes" WHERE ("envelopes"."id" = 1)

  def edit
    @envelope = Envelope.find(params[:id])
---
SELECT * FROM "envelopes" WHERE ("envelopes"."id" = 1)

  def create
    @envelope = Envelope.new(params[:envelope])

    respond_to do |format|
      if @envelope.save
---
INSERT INTO "envelopes" ("updated_at", "account_id", "email_blurb", "document_file_name", "recipient_email", "document_file_size", "ds_id", "status_updated_at", "subject", "document_updated_at", "ds_status", "document_content_type", "recipient_name", "state", "created_at") VALUES('2009-02-02 03:46:55', '11a14cbf-03fb-4aed-87ba-55cc771fcfc6', 'Blurb', 'test.pdf', 'fake@email.com', 8167, NULL, NULL, 'Subject', '2009-02-02 03:46:55', NULL, 'application/pdf', 'John Johnson', 'pending', '2009-02-02 03:46:55')

  def update
    @envelope = Envelope.find(params[:id])

    respond_to do |format|
      if @envelope.update_attributes(params[:envelope])
---
SELECT * FROM "envelopes" WHERE ("envelopes"."id" = 3)
UPDATE "envelopes" SET "document_content_type" = 'application/pdf', "document_file_size" = 8167, "document_file_name" = 'test.pdf', "document_updated_at" = '2009-02-01 21:01:10', "updated_at" = '2009-02-01 21:01:10' WHERE "id" = 3

  def send_envelope
    @envelope = Envelope.find(params[:id])
---
SELECT * FROM "envelopes" WHERE ("envelopes"."id" = 3)

  def refresh_status
    @envelope = Envelope.find(params[:id])
---
SELECT * FROM "envelopes" WHERE ("envelopes"."id" = 1)

  def destroy
    @envelope = Envelope.find(params[:id])
    @envelope.destroy
---
SELECT * FROM "envelopes" WHERE ("envelopes"."id" = 1)
DELETE FROM "envelopes" WHERE "id" = 1